from django.db import models

class Household_filters(models.Model):
	
	Category_list = [
		("191", "Колбы BB (Aquapro)"),
		("192", "Колбы SL (Aquapro)"),
		("193", "Баки (Aquapro)"),
		("140", "Бустерные насосы (Aquapro)"),
		("196", "Запчасти (Aquapro)"),
		("197", "Картриджи механической очистки (Aquapro)"),
		("198", "Картриджи угольные (Aquapro)"),
		("195", "Мембраны, постфильтры (Aquapro)"),
		("199", "Бытовые системы обратного осмоса (Aquapro)"),
		("271", "Canature"),
		("223", "Запчасти (NatureWater)"),
		("221", "Колбы BB (NatureWater)"),
		("222", "Колбы SL (NatureWater)"),
		("219", "Картриджи (NatureWater)"),
		("226", "Постфильтры (NatureWater)"),
		("225", "Бытовые системы водоочистки (NatureWater)"),
		("133", "Картриджи Аргумент, колбы Housing, Vontron"),
		("25", "Картриджи механической очистки (Аргумент)"),
		("26", "Картриджи угольные, умягчения, обезжелезивания (Аргумент)"),
		("27", "Колoбы Housing"),
		("28", "Мембраны Vontron и Canature")
	]
	Nomenclature_list = [
		("Мембраны и корпуса", "Мембраны и корпуса"),
		("Набор-комплект(б/х)", "Набор-комплект(б/х)"),
		("Аксессуары и запчасти для клапанов управления", "Аксессуары и запчасти для клапанов управления"),
		("Аксессуары и запчасти к колбам, быт. системам", "Аксессуары и запчасти к колбам, быт. системам"),
		("Баки для воды", "Баки для воды"),
		("Баки реагентные и запчасти", "Баки реагентные и запчасти"),
		("Бытовые системы", "Бытовые системы"),
		("Водосчетчики", "Водосчетчики"),
		("Дозирующие насосы и аксессуары", "Дозирующие насосы и аксессуары"),
		("ДРС", "ДРС"),
		("Загрузки, реагенты, химия", "Загрузки, реагенты, химия"),
		("Картриджи", "Картриджи"),
		("Клапана управления", "Клапана управления"),
		("Колбы", "Колбы"),
		("Корпуса", "Корпуса"),
		("Напорная аэрация", "Напорная аэрация"),
		("Насосы", "Насосы"),
		("ПВХ", "ПВХ"),
		("Промышленные осмоса и Ультрафильтация", "Промышленные осмоса и Ультрафильтация"),
		("Прочее", "Прочее"),
		("Ротаметры", "Ротаметры"),
		("Станции дозирования", "Станции дозирования"),
		("Установки ионообменные", "Установки ионообменные"),
		("Установки фильтрации безреагентные", "Установки фильтрации безреагентные"),
		("Установки фильтрации реагентные", "Установки фильтрации реагентные"),
		("УФ Стерелизаторы и аксессуары", "УФ Стерелизаторы и аксессуары"),
		("Фильтры грубой очистки", "Фильтры грубой очистки"),
		("Электромагнитные клапана", "Электромагнитные клапана"),
		("Услуга округления", "Услуга округления")
	]
	Vendor_list = [
		("Aqua", "Aqua"),
		("Aquapro", "Aquapro"),
		("Autotrol", "Autotrol"),
		("AWT", "AWT"),
		("Canature", "Canature"),
		("Cepex", "Cepex"),
		("Cintropur", "Cintropur"),
		("Clack", "Clack"),
		("CNP", "CNP"),
		("CSM", "CSM"),
		("Ecosoft", "Ecosoft"),
		("ELITECH", "ELITECH"),
		("Euraqua", "Euraqua"),
		("Filmtec", "Filmtec"),
		("Fleck", "Fleck"),
		("Grundfos", "Grundfos"),
		("Mytho", "Mytho"),
		("NanoRo", "NanoRo"),
		("NatureWater", "NatureWater"),
		("NOCCHI", "NOCCHI"),
		("Noname", "Noname"),
		("Noyi", "Noyi"),
		("Pentair", "Pentair"),
		("Philips", "Philips"),
		("Pimtas", "Pimtas"),
		("Runxin", "Runxin"),
		("Seko", "Seko"),
		("STRUCTURAL", "STRUCTURAL"),
		("Vontron", "Vontron"),
		("Wave Cyber", "Wave Cyber"),
		("Zenner", "Zenner"),
		("Аргеллит", "Аргеллит"),
		("ЕВРОПА", "ЕВРОПА"),
		("ИНДИЯ", "ИНДИЯ"),
		("КИТАЙ", "КИТАЙ"),
		("КОРЕЯ", "КОРЕЯ"),
		("РОССИЯ", "РОССИЯ"),
		("США", "США"),
		("Тайвань", "Тайвань")
	]
	Status_list = [
		("В наличии", "В наличии"),
		("Отсутствует", "Отсутствует")
	]
	Pump_list = [
		("Есть", "Есть"),
		("Нет", "Нет"),
	]
	Tank_capacity_list = [
		("Отсутствует", "Отсутствует"),
		("До 12 литров", "До 12 литров"),
		("До 8 литров", "До 8 литров")		
	]
	Additional_options_list = [
		("Отсутствует", "Отсутствует"),
		("С минерализатором", "С минерализатором"),
		("С полифостфатом", "С полифостфатом")
	]
	PrType_list = [
		("Аксессуары и запчасти", "Аксессуары и запчасти"),
		("Прочее", "Прочее"),
		("Осмос", "Осмос"),
		("Система", "Система"),
		("Фильтр от накипи", "Фильтр от накипи"),
		("Контейнер под загрузку", "Контейнер под загрузку"),
		("Механической очистки", "Механической очистки"),
		("Обезжелезивания и деманганации", "Обезжелезивания и деманганации"),
		("Угольный гранулированный", "Угольный гранулированный"),
		("Угольный прессованый", "Угольный прессованый"),
		("Умягчения", "Умягчения"),
		("корпуса для осмосов", "корпуса для осмосов"),
		("обратноосмотические мембраны", "обратноосмотические мембраны"),
		("2-х и 3-х ходовые клапана", "2-х и 3-х ходовые клапана"),
		("Запчасти и комплектующие", "Запчасти и комплектующие"),
		("Инжектора", "Инжектора"),
		("Комплектующие (ПВХ и т. п.)", "Комплектующие (ПВХ и т. п.)"),
		("Комплектующие осмос", "Комплектующие осмос"),
		("Тарировочные шайбы", "Тарировочные шайбы"),
		("Емкость", "Емкость"),
		("Комплектующие", "Комплектующие"),
		("для дозации", "для дозации"),
		("Копмплектующие и запчасти", "Копмплектующие и запчасти"),
		("Марганцовочный", "Марганцовочный"),
		("Солевой", "Солевой"),
		("Импульсные", "Импульсные"),
		("Аналоговые", "Аналоговые"),
		("Цифровые", "Цифровые"),
		("Верхние дистрибьюторы и распред. системы", "Верхние дистрибьюторы и распред. системы"),
		("Нижние дистрибьюторы и распред. системы", "Нижние дистрибьюторы и распред. системы"),
		("Трубы", "Трубы"),
		("Миксы", "Миксы"),
		("Осветление/обезжелезивание", "Осветление/обезжелезивание"),
		("Смолы", "Смолы"),
		("Сорбция", "Сорбция"),
		("Химия и реагенты", "Химия и реагенты"),
		("Безреагентный - автоматический", "Безреагентный - автоматический"),
		("Безреагентный - ручной", "Безреагентный - ручной"),
		("Реагентный - автоматический", "Реагентный - автоматический"),
		("Реагентный - ручной", "Реагентный - ручной"),
		("Аксессуары", "Аксессуары"),
		("Корпуса (для гор. воды)", "Корпуса (для гор. воды)"),
		("Корпуса (для хол. воды)", "Корпуса (для хол. воды)"),
		("комплектующие", "комплектующие"),
		("Напорная аэрация", "Напорная аэрация"),
		("вертикальный", "вертикальный"),
		("горизонтальный", "горизонтальный"),
		("Запчасти", "Запчасти"),
		("Клапана", "Клапана"),
		("Клей и растворитель", "Клей и растворитель"),
		("Краны", "Краны"),
		("Муфты разборные", "Муфты разборные"),
		("Отводы", "Отводы"),
		("Сёдла", "Сёдла"),
		("Смотровые стекла", "Смотровые стекла"),
		("Тройники и крестовины", "Тройники и крестовины"),
		("Трубы", "Трубы"),
		("Фитинги", "Фитинги"),
		("Фланцы и адаптеры", "Фланцы и адаптеры")
	]
	For_flasks_list = [
		("Ключи", "Ключи"),
		("Кронштейны", "Кронштейны"),
		("Прочее", "Прочее")
	]
	For_system_list = [
		("Бустерные насосы (помпы)", "Бустерные насосы (помпы)"),
		("Краны", "Краны"),
		("Мембранные баки", "Мембранные баки"),
		("Постфильтры и паки", "Постфильтры и паки"),
		("Прочее", "Прочее")
	]
	Application_list = [
		("Бытовое", "Бытовое"),
		("Промышленное", "Промышленное"),
		("На холодную воду", "На холодную воду"),
		("На горячую воду", "На горячую воду")
	]
	Performance_list = [
		("100 GPD", "100 GPD"),
		("50 GPD", "50 GPD"),
		("60 GPD", "60 GPD"),
		("75 GPD", "75 GPD"),
		("более 1м3/час", "более 1м3/час"),
		("до 1м3/час", "до 1м3/час")
	]
	Size_list = [
		("1812", "1812"),
		("2012", "2012"),
		("2521", "2521"),
		("2540", "2540"),
		("2812", "2812"),
		("3012", "3012"),
		("4021", "4021"),
		("4040", "4040"),
		("8040", "8040"),
		("BB 10", "BB 10"),
		("BB 20", "BB 20"),
		("SL 5", "SL 5"),
		("SL 10", "SL 10"),
		("SL 20", "SL 20"),
		("SL 30", "SL 30"),
		("SL 40", "SL 40")
	]
	Microtity_list = [
		("не измеряется", "не измеряется"),
		("0,5", "0,5"),
		("1", "1"),
		("5", "5"),
		("10", "10"),
		("20", "20"),
		("25", "25"),
		("50", "50"),
		("100", "100")
	]
	Fitting_list = [
		("JC (резьба)", "JC (резьба)"),
		("JG (быстросъемное)", "JG (быстросъемное)")
	]
	Cartridge_size_list = [
		("прочее", "прочее"),
		("BB 10", "BB 10"),
		("BB 20", "BB 20"),
		("SL 5", "SL 5"),
		("SL 10", "SL 10"),
		("SL 20", "SL 20"),
		("SL 30", "SL 30"),
		("SL 40", "SL 40")
	]
	Volume_list = [
		("1000 л", "1000 л"),
		("10000 л", "10000 л"),
		("120 л", "120 л"),
		("1250 л", "1250 л"),
		("15000 л", "15000 л"),
		("200 л", "200 л"),
		("2000 л", "2000 л"),
		("210 л", "210 л"),
		("250 л", "250 л"),
		("3000 л", "3000 л"),
		("330 л", "330 л"),
		("440 л", "440 л"),
		("500 л", "500 л"),
		("5000 л", "5000 л"),
		("550 л", "550 л"),
		("700 л", "700 л"),
		("780 л", "780 л"),
		("8000 л", "8000 л"),
		("100 л", "100 л"),
		("140 л", "140 л"),
		("145 л", "145 л"),
		("60 л", "65 л"),
		("70 л", "70 л"),
		("750 л", "750 л")
	]
	Form_list = [
		("горизонтальная", "горизонтальная"),
		("круглая", "круглая"),
		("прямоугольная", "прямоугольная")
	]
	Accession_list = [
		("DN125(фланец)", "DN125(фланец)"),
		("DN15", "DN15"),
		("DN150(фланец)", "DN150(фланец)"),
		("DN20", "DN20"),
		("DN25", "DN25"),
		("DN32", "DN32"),
		("DN40", "DN40"),
		("DN50", "DN50"),
		("DN65(фланец)", "DN65(фланец)"),
		("DN80(фланец)", "DN80(фланец)"),
		('1/2"', '1/2"'),
		('1/4"','1/4"'),
		('1"', '1"'),
		('3/4"', '3/4"')
	]
	View_list = [
		("Бок. посадка", "Бок. посадка"),
		("Стандарт", "Стандарт")
	]
	For_enclosures_list = [
		("0817-3672", "0817-3672"),
		("4272-6386", "4272-6386"),
		("4272-6386", "4272-6386")
	]
	Interface_language_list = [
		("Английский", "Английский"),
		("Русский", "Русский")
	]
	Neck_list = [
		('2,5"-0', '2,5"-0'),
		('4"-0', '4"-0'),
		('4"-4inch', '4"-4inch'),
		('6"-6inch (фланцы)', '6"-6inch (фланцы)')
	]
	Compressor_list = [
		("AP2", "AP2"),
		("AS19", "AS19"),
		("CAP2(AP200)", "CAP2(AP200)"),
		("LP12", "LP12")
	]
	Balloon_size_list = [
		("0844", "0844"),
		("1035", "1035"),
		("1044", "1044"),
		("1054", "1054"),
		("1248", "1248"),
		("1252", "1252"),
		("1354", "1354"),
		("1465", "1465"),
		("1665", "1665"),
		("1865", "1865"),
		("2162", "2162"),
		("2472", "2472"),
		("3072", "3072"),
		("3672", "3672")
	]
	Water_pillar_list = [
		("более 80 м", "более 80 м"),
		("до 50 м", "до 50 м"),
		("от 50 до 80 м", "от 50 до 80 м")
	]
	Voltage_list = [
		("220V", "220V"),
		("380V", "380V")
	]
	PerformanceQ_list = [
		("До 5 м3/ч", "До 5 м3/ч"),
		("от 15 м3/ч", "от 15 м3/ч"),
		("От 5 м3/ч до 15 м3/ч", "От 5 м3/ч до 15 м3/ч")
	]
	Color_list = [
		("Белый", "Белый"),
		("Красный", "Красный"),
		("Прозрачный", "Прозрачный"),
		("Синий", "Синий"),
		("Стальной", "Стальной")
	]
	Size_mm_list = [
		("20мм", "20мм"),
		("25мм", "25мм"),
		("32мм", "32мм"),
		("40мм", "40мм"),
		("50мм", "50мм"),
		("63мм", "63мм"),
		("75мм", "75мм"),
		("90мм", "90мм"),
		("100мм", "100мм"),
		("110мм", "110мм"),
		("125мм", "125мм"),
		("140мм", "140мм"),
		("150мм", "150мм"),
		("160мм", "160мм"),
		("200мм", "200мм")
	]
	Compound_list = [
		("Внутренняя резьба (ВР)", "Внутренняя резьба (ВР)"),
		("Герметичное", "Герметичное"),
		("Клеевое", "Клеевое"),
		("Клеевое-резьбовое", "Клеевое-резьбовое"),
		("Наружняя резьба (НР)", "Наружняя резьба (НР)"),
		("Резьбовое", "Резьбовое"),
		("Фланцевое", "Фланцевое")
	]

	Name = models.CharField(max_length=120, verbose_name='Название')
	Image = models.ImageField(upload_to='householdfilters/', blank=False, verbose_name='Изображение')
	Category = models.CharField(max_length=50, choices=Category_list, verbose_name='Категория')
	Vendor = models.CharField(max_length=50, choices=Vendor_list, verbose_name='Производитель')
	Nomenclature = models.CharField(max_length=50, choices=Nomenclature_list, blank=True, verbose_name='Вид номенклатуры')

	Size = models.CharField(max_length=50, choices=Size_list, blank=True, verbose_name='Размер')
	Accession = models.CharField(max_length=50, choices=Accession_list, blank=True, verbose_name='Присоединение')
	Color = models.CharField(max_length=50, choices=Color_list, blank=True, verbose_name='Цвет')
	For_systems = models.CharField(max_length=50, choices=For_system_list, blank=True, verbose_name='Для систем')
	Cartridge_size = models.CharField(max_length=50, choices=Cartridge_size_list, blank=True, verbose_name='Размер картриджа')
	Microtity = models.CharField(max_length=50, choices=Microtity_list, blank=True, verbose_name='Микронность')
	Application = models.CharField(max_length=50, choices=Application_list, blank=True, verbose_name='Применение')
	PrType = models.CharField(max_length=50, choices=PrType_list, blank=True, verbose_name='Тип')
	Additional_options = models.CharField(max_length=50, choices=Additional_options_list, blank=True, verbose_name='Дополнительные опции')
	Tank_capacity = models.CharField(max_length=50, choices=Tank_capacity_list, blank=True, verbose_name='Емкость бака')
	Pump = models.CharField(max_length=50, choices=Pump_list, blank=True, verbose_name='Наличие насоса')
	
	About = models.TextField(blank=True)
	Status = models.CharField(max_length=50, choices=Status_list, blank=True, verbose_name='Наличие товара')
	Price =  models.IntegerField()
	#Продолжить начиная с Промышленные осмоса и Ультрафильтация
	def __str__(self):
		return str(self.Name)

'''
	Name = models.CharField(max_length=120, verbose_name='Название')
	Image = models.ImageField(upload_to='householdfilters/', blank=False, verbose_name='Изображение')
	Nomenclature = models.CharField(max_length=50, choices=Nomenclature_list, blank=True, verbose_name='Вид номенклатуры')
	Vendor = models.CharField(max_length=50, choices=Vendor_list, blank=True, verbose_name='Полизводитель')
	For_systems = models.CharField(max_length=50, choices=For_system_list, blank=True, verbose_name='Для систем')
	Pump = models.CharField(max_length=50, choices=Pump_list, blank=True, verbose_name='Наличие насоса')
	Tank_capacity = models.CharField(max_length=50, choices=Tank_capacity_list, blank=True, verbose_name='Емкость бака')
	Additional_options = models.CharField(max_length=50, choices=Additional_options_list, blank=True, verbose_name='Дополнительные опции')
	PrType = models.CharField(max_length=50, choices=PrType_list, blank=True, verbose_name='Тип')
	For_flasks = models.CharField(max_length=50, choices=For_flasks_list, blank=True, verbose_name='Для колб')
	Application = models.CharField(max_length=50, choices=Application_list, blank=True, verbose_name='Применение')
	Performance = models.CharField(max_length=50, choices=Performance_list, blank=True, verbose_name='Производительность')
	PerformanceQ = models.CharField(max_length=50, choices=PerformanceQ_list, blank=True, verbose_name='Производительность Q  м3 ч')
	Size = models.CharField(max_length=50, choices=Size_list, blank=True, verbose_name='Размер')
	Microtity = models.CharField(max_length=50, choices=Microtity_list, blank=True, verbose_name='Микронность')
	Fitting = models.CharField(max_length=50, choices=Fitting_list, blank=True, verbose_name='Фитинги')
	Cartridge_size = models.CharField(max_length=50, choices=Cartridge_size_list, blank=True, verbose_name='Размер картриджа')
	Volume = models.CharField(max_length=50, choices=Volume_list, blank=True, verbose_name='Объем')
	Form = models.CharField(max_length=50, choices=Form_list, blank=True, verbose_name='Форма')
	Accession = models.CharField(max_length=50, choices=Accession_list, blank=True, verbose_name='Присоединение')
	View = models.CharField(max_length=50, choices=View_list, blank=True, verbose_name='Вид')
	For_enclosures = models.CharField(max_length=50, choices=For_enclosures_list, blank=True, verbose_name='Для корпусов')
	Interface_language = models.CharField(max_length=50, choices=Interface_language_list, blank=True, verbose_name='Язык интерфейса')
	Neck = models.CharField(max_length=50, choices=Neck_list, blank=True, verbose_name='Горловина')
	Compressor = models.CharField(max_length=50, choices=Compressor_list, blank=True, verbose_name='Компрессор')
	Balloon_size = models.CharField(max_length=50, choices=Balloon_size_list, blank=True, verbose_name='Размер баллона')
	Water_pillar = models.CharField(max_length=50, choices=Water_pillar_list, blank=True, verbose_name='H м вод ст')
	Voltage = models.CharField(max_length=50, choices=Voltage_list, blank=True, verbose_name='Напряжение')
'''
	Size_mm = models.CharField(max_length=50, choices=Size_mm_list, blank=True, verbose_name='Размер мм')
	Compound = models.CharField(max_length=50, choices=Compound_list, blank=True, verbose_name='Соединение')
'''
	About = models.TextField(blank=True)
	Value = models.IntegerField()
	Price =  models.IntegerField()
'''

class Optional_equipment(models.Model):
		Category_list = [
		("191", "Колбы BB (Aquapro)"),
		("192", "Колбы SL (Aquapro)"),
		("193", "Баки (Aquapro)"),
		("140", "Бустерные насосы (Aquapro)"),
		("196", "Запчасти (Aquapro)"),
		("197", "Картриджи механической очистки (Aquapro)"),
		("198", "Картриджи угольные (Aquapro)"),
		("195", "Мембраны, постфильтры (Aquapro)"),
		("199", "Бытовые системы обратного осмоса (Aquapro)"),
		("271", "Canature"),
		("223", "Запчасти (NatureWater)"),
		("221", "Колбы BB (NatureWater)"),
		("222", "Колбы SL (NatureWater)"),
		("219", "Картриджи (NatureWater)"),
		("226", "Постфильтры (NatureWater)"),
		("225", "Бытовые системы водоочистки (NatureWater)"),
		("133", "Картриджи Аргумент, колбы Housing, Vontron"),
		("25", "Картриджи механической очистки (Аргумент)"),
		("26", "Картриджи угольные, умягчения, обезжелезивания (Аргумент)"),
		("27", "Колoбы Housing"),
		("28", "Мембраны Vontron и Canature")
	]
	Nomenclature_list = [
		("Мембраны и корпуса", "Мембраны и корпуса"),
		("Набор-комплект(б/х)", "Набор-комплект(б/х)"),
		("Аксессуары и запчасти для клапанов управления", "Аксессуары и запчасти для клапанов управления"),
		("Аксессуары и запчасти к колбам, быт. системам", "Аксессуары и запчасти к колбам, быт. системам"),
		("Баки для воды", "Баки для воды"),
		("Баки реагентные и запчасти", "Баки реагентные и запчасти"),
		("Бытовые системы", "Бытовые системы"),
		("Водосчетчики", "Водосчетчики"),
		("Дозирующие насосы и аксессуары", "Дозирующие насосы и аксессуары"),
		("ДРС", "ДРС"),
		("Загрузки, реагенты, химия", "Загрузки, реагенты, химия"),
		("Картриджи", "Картриджи"),
		("Клапана управления", "Клапана управления"),
		("Колбы", "Колбы"),
		("Корпуса", "Корпуса"),
		("Напорная аэрация", "Напорная аэрация"),
		("Насосы", "Насосы"),
		("ПВХ", "ПВХ"),
		("Промышленные осмоса и Ультрафильтация", "Промышленные осмоса и Ультрафильтация"),
		("Прочее", "Прочее"),
		("Ротаметры", "Ротаметры"),
		("Станции дозирования", "Станции дозирования"),
		("Установки ионообменные", "Установки ионообменные"),
		("Установки фильтрации безреагентные", "Установки фильтрации безреагентные"),
		("Установки фильтрации реагентные", "Установки фильтрации реагентные"),
		("УФ Стерелизаторы и аксессуары", "УФ Стерелизаторы и аксессуары"),
		("Фильтры грубой очистки", "Фильтры грубой очистки"),
		("Электромагнитные клапана", "Электромагнитные клапана"),
		("Услуга округления", "Услуга округления")
	]
	Vendor_list = [
		("Aqua", "Aqua"),
		("Aquapro", "Aquapro"),
		("Autotrol", "Autotrol"),
		("AWT", "AWT"),
		("Canature", "Canature"),
		("Cepex", "Cepex"),
		("Cintropur", "Cintropur"),
		("Clack", "Clack"),
		("CNP", "CNP"),
		("CSM", "CSM"),
		("Ecosoft", "Ecosoft"),
		("ELITECH", "ELITECH"),
		("Euraqua", "Euraqua"),
		("Filmtec", "Filmtec"),
		("Fleck", "Fleck"),
		("Grundfos", "Grundfos"),
		("Mytho", "Mytho"),
		("NanoRo", "NanoRo"),
		("NatureWater", "NatureWater"),
		("NOCCHI", "NOCCHI"),
		("Noname", "Noname"),
		("Noyi", "Noyi"),
		("Pentair", "Pentair"),
		("Philips", "Philips"),
		("Pimtas", "Pimtas"),
		("Runxin", "Runxin"),
		("Seko", "Seko"),
		("STRUCTURAL", "STRUCTURAL"),
		("Vontron", "Vontron"),
		("Wave Cyber", "Wave Cyber"),
		("Zenner", "Zenner"),
		("Аргеллит", "Аргеллит"),
		("ЕВРОПА", "ЕВРОПА"),
		("ИНДИЯ", "ИНДИЯ"),
		("КИТАЙ", "КИТАЙ"),
		("КОРЕЯ", "КОРЕЯ"),
		("РОССИЯ", "РОССИЯ"),
		("США", "США"),
		("Тайвань", "Тайвань")
	]
	PrType_list = [
		("Аксессуары и запчасти", "Аксессуары и запчасти"),
		("Прочее", "Прочее"),
		("Осмос", "Осмос"),
		("Система", "Система"),
		("Фильтр от накипи", "Фильтр от накипи"),
		("Контейнер под загрузку", "Контейнер под загрузку"),
		("Механической очистки", "Механической очистки"),
		("Обезжелезивания и деманганации", "Обезжелезивания и деманганации"),
		("Угольный гранулированный", "Угольный гранулированный"),
		("Угольный прессованый", "Угольный прессованый"),
		("Умягчения", "Умягчения"),
		("корпуса для осмосов", "корпуса для осмосов"),
		("обратноосмотические мембраны", "обратноосмотические мембраны"),
		("2-х и 3-х ходовые клапана", "2-х и 3-х ходовые клапана"),
		("Запчасти и комплектующие", "Запчасти и комплектующие"),
		("Инжектора", "Инжектора"),
		("Комплектующие (ПВХ и т. п.)", "Комплектующие (ПВХ и т. п.)"),
		("Комплектующие осмос", "Комплектующие осмос"),
		("Тарировочные шайбы", "Тарировочные шайбы"),
		("Емкость", "Емкость"),
		("Комплектующие", "Комплектующие"),
		("для дозации", "для дозации"),
		("Копмплектующие и запчасти", "Копмплектующие и запчасти"),
		("Марганцовочный", "Марганцовочный"),
		("Солевой", "Солевой"),
		("Импульсные", "Импульсные"),
		("Аналоговые", "Аналоговые"),
		("Цифровые", "Цифровые"),
		("Верхние дистрибьюторы и распред. системы", "Верхние дистрибьюторы и распред. системы"),
		("Нижние дистрибьюторы и распред. системы", "Нижние дистрибьюторы и распред. системы"),
		("Трубы", "Трубы"),
		("Миксы", "Миксы"),
		("Осветление/обезжелезивание", "Осветление/обезжелезивание"),
		("Смолы", "Смолы"),
		("Сорбция", "Сорбция"),
		("Химия и реагенты", "Химия и реагенты"),
		("Безреагентный - автоматический", "Безреагентный - автоматический"),
		("Безреагентный - ручной", "Безреагентный - ручной"),
		("Реагентный - автоматический", "Реагентный - автоматический"),
		("Реагентный - ручной", "Реагентный - ручной"),
		("Аксессуары", "Аксессуары"),
		("Корпуса (для гор. воды)", "Корпуса (для гор. воды)"),
		("Корпуса (для хол. воды)", "Корпуса (для хол. воды)"),
		("комплектующие", "комплектующие"),
		("Напорная аэрация", "Напорная аэрация"),
		("вертикальный", "вертикальный"),
		("горизонтальный", "горизонтальный"),
		("Запчасти", "Запчасти")
	]
	Status_list = [
		("В наличии", "В наличии"),
		("Отсутствует", "Отсутствует")
	]
	Name = models.CharField(max_length=120, verbose_name='Название')
	Image = models.ImageField(upload_to='optionalequipment/', blank=False, verbose_name='Изображение')
	Category = models.CharField(max_length=50, choices=Category_list, verbose_name='Категория')
	Vendor = models.CharField(max_length=50, choices=Vendor_list, verbose_name='Производитель')
	Nomenclature = models.CharField(max_length=50, choices=Nomenclature_list, blank=True, verbose_name='Вид номенклатуры')
	
	PrType = models.CharField(max_length=50, choices=PrType_list, blank=True, verbose_name='Тип')

	About = models.TextField(blank=True)
	Status = models.CharField(max_length=50, choices=Status_list, blank=True, verbose_name='Наличие товара')
	Price =  models.IntegerField()
	
	def __str__(self):
		return str(self.Name)